routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 10], ["created_at", "2019-01-29 00:50:29.790952"], ["updated_at", "2019-01-29 00:50:29.790952"]]
---
  def create
    artwork_shares = ArtworkShare.new(artwork_share_params)
    # debugger
    artwork_shares.save!

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
---
  def destroy
    artwork_shares = ArtworkShare.find_by(id: params[:id])
    artwork_shares.destroy!