routes/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 10], ["LIMIT", 1]]
---
  def index
    render json: {user_artwork: Artwork.find_by(artist_id: params[:user_id]),
                  user_shared_artworks: User.find_by(id: params[:user_id]).shared_artworks}

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def destroy
    # debugger
    artwork = Artwork.find_by(id: params[:id])