routes/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "user"], ["email", "abc@gmail.com"], ["created_at", "2019-01-28 22:46:53.876263"], ["updated_at", "2019-01-28 22:46:53.876263"]]

  def destroy
    # debugger
    user = User.find_by(id: params[:id])
    user.destroy!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 13]]

  def update
    user = User.find_by(id: params[:id])
    # debugger
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "user2"], ["id", 15]]